W7D3/MusicApp/app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mIW6DNx9u-zaZ5-gnk0ckw"], ["updated_at", "2022-06-01 23:17:39.834523"], ["id", 4]]